//Дан массив с элементами [1, 2, 3, 4, 5]. С помощью цикла for найдите сумму элементов этого массива
//Запишите ее в переменную result.
//let arr = [1,2,3,4,5]
//let result = 0
//for (let i=0; i < arr.length; i++){
   // result += arr[i]
//}
//console.log(result)

//2) [1, 2, 3, 4, 5, 6, 7, 8, 9, 10] => сумму всех элементов массива
//const handlefuction = (arr)=> {
 //  let res = 0
   // for (let i = 0;i<arr.length;i++) {
  //  }
  //  return res
//}
//console.log(handlefuction([1,2,3,4,5,6,7,8,9,10]))

//3) Дан массив с элементами [1, 2, 5, 9, 4, 13, 4, 10]. С помощью цикла for и оператора if проверьте есть ли в массиве элемент со значением, равным 4. Если есть - выведите на экран 'Есть!' и выйдите из цикла. Если нет - 'Нет!'

//let arr = [1, 2, 5, 9, 4, 13, 4, 10];

//for(i = 0; i < arr.length; i++){
  //  if(arr[i] == 4){
  //    alert('Есть');
   //    break;
   // }
//}
//
